####  Aggregation is the process of turning the values of a dataset (or a subset of it) into one single value

#### For ex  by doing  sum , mean , median ,mode etc  we turn a set of data into a single value

In [3]:
import pandas as pd
import numpy as np

In [4]:
df = pd.DataFrame([["Arjun",98,90,87],["Brian",90,86,65],["Carl",80,50,66]],columns=["Name","Test1","Test2","Test3"])
df

    Name  Test1  Test2  Test3
0  Arjun     98     90     87
1  Brian     90     86     65
2   Carl     80     50     66

### df.count()

In [7]:
df_count = df.copy()
df_count["count"]= df_count.count(axis=1)
df_count

    Name  Test1  Test2  Test3  count
0  Arjun     98     90     87      4
1  Brian     90     86     65      4
2   Carl     80     50     66      4

### df.sum()

### adding row wise

In [30]:
df1 = df.copy()
df1["Total"]= df1.sum(axis=1)
df1

    Name  Test1  Test2  Test3  Total
0  Arjun     98     90     87    275
1  Brian     90     86     65    241
2   Carl     80     50     66    196

### adding columns wise making row

In [31]:
df2 = df.copy()
df2.loc["Total"]=df2.sum()
df2

                 Name  Test1  Test2  Test3
0               Arjun     98     90     87
1               Brian     90     86     65
2                Carl     80     50     66
Total  ArjunBrianCarl    268    226    218

### df.mean()

In [8]:
df3 = df.copy()
df3["Avg"]= df3.mean(axis=1).round(2)
df3

    Name  Test1  Test2  Test3    Avg
0  Arjun     98     90     87  91.67
1  Brian     90     86     65  80.33
2   Carl     80     50     66  65.33

### df.max()

In [9]:
df4 = df.copy()
df4["Max"]= df4.max(axis=1)
df4

    Name  Test1  Test2  Test3  Max
0  Arjun     98     90     87   98
1  Brian     90     86     65   90
2   Carl     80     50     66   80

### df.min()

In [10]:
df5 = df.copy()
df5["Min"]= df5.min(axis=1)
df5

    Name  Test1  Test2  Test3  Min
0  Arjun     98     90     87   87
1  Brian     90     86     65   65
2   Carl     80     50     66   50

### df.median()

In [11]:
df6 = df.copy()
df6["Median"]= df6.median(axis=1)
df6

    Name  Test1  Test2  Test3  Median
0  Arjun     98     90     87    90.0
1  Brian     90     86     65    86.0
2   Carl     80     50     66    66.0

#### there are others also like df.std() , df.var() , df.skew() , df.kurt()

###  Challenge 1 :  Make  a  dataframe like below

####  1st : add a new row to original dataframe representing sum of all columns 
####  2nd : add a new row to original dataframe representing mean of all columns 
####  3rd : add a new row to original dataframe representing max of all columns 
####  4th : add a new row to original dataframe representing min of all columns 
####  5th : add a new row to original dataframe representing median of all columns

In [13]:
df_score = pd.DataFrame([["Adam",38,46,45],["Brett",44,34,20],["Chris",9,50,50]],columns=["Name","Test1","Test2","Test3"])
df_score

    Name  Test1  Test2  Test3
0   Adam     38     46     45
1  Brett     44     34     20
2  Chris      9     50     50

In [14]:
df1 = df_score.copy()
df1["Sum"] = df_score.sum(axis=1)
df1

    Name  Test1  Test2  Test3  Sum
0   Adam     38     46     45  129
1  Brett     44     34     20   98
2  Chris      9     50     50  109

In [39]:
df2 = df_score.copy()
df2["mean"] = df_score.mean(axis=1).round()
df2

    Name  Test1  Test2  Test3  mean
0   Adam     38     46     45  43.0
1  Brett     44     34     20  33.0
2  Chris      9     50     50  36.0

In [40]:
df3 = df_score.copy()
df3["Max"] = df_score.max(axis=1)
df3

    Name  Test1  Test2  Test3  Max
0   Adam     38     46     45   46
1  Brett     44     34     20   44
2  Chris      9     50     50   50

In [41]:
df4 = df_score.copy()
df4["Max"] = df4.max(axis=1)
df4

    Name  Test1  Test2  Test3  Max
0   Adam     38     46     45   46
1  Brett     44     34     20   44
2  Chris      9     50     50   50

In [42]:
df5 = df_score.copy()
df5["Median"] = df5.median(axis=1)
df5

    Name  Test1  Test2  Test3  Median
0   Adam     38     46     45    45.0
1  Brett     44     34     20    34.0
2  Chris      9     50     50    50.0

In [43]:
pd.__version__

'1.1.5'

In [44]:
np.__version__

'1.19.2'